public_html/hw3.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>CSPP 53001: Assignment 3</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="CSPP 53001: Assignment 3"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-04-23 22:24:24 CDT"/>
<meta name="author" content="Neil Best"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">CSPP 53001: Assignment 3</h1>

<p><b>Online homework and project due by 11:59am on Thursday, May 2, 2013</b>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Step 2 of Your TBP</a>
<ul>
<li>
<ul>
<li><a href="#sec-1-1">1.1 Problem Set</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Step 2 of Your TBP</h2>
<div class="outline-text-2" id="text-1">


<p>
The second part of your TBP project is to create a database in MySQL,
populate it with some real data and run several interesting queries.
</p>
<ol>
<li>Get a MySQL account. For specific instructions on how to get a MySQL
   account, login to MySQL, create relations, etc. please, refer to
   <a href="mysql-intro.html"><i>Getting Started With MySQL</i></a>. Get acquainted
   with MySQL, change your initial password, experiment with some simple
   commands, and check out the <code>help</code> command.
</li>
<li>Create relations for your TBP based on your final relational schema
   from <b>Step 1</b>. In addition to creating the appropriate attributes and
   types, please declare <i>primary keys</i> for your relations. The
   attribute types supported by MySQL are described in the
   <a href="http://dev.mysql.com/doc/refman/5.5/en/data-types.html">MySQL online documentation</a> Please, generate a script file called
   <code>create_db.sql</code> that creates all of your tables.
</li>
<li>Develop a small amount (10-20 tuples per relation) of real data and
   load it into your relations using the <code>SQL load</code> command. See
   <a href="mysql-load.html"><i>Loading Data in MySQL</i></a> and for information on how
   to bulk-load data. Please, generate a script file called
   <code>populate_db.sql</code> that loads all of your tables. Note that the script
   will likely reference several data files in your directory.
</li>
<li>Develop and test at least six SQL data retrieval (<code>select</code>) commands.
</li>
<li>Please, generate a script file called <code>query2.sql</code> with all of your
   queries.
</li>
</ol>


<p>
Please note:
</p>
<ul>
<li>You can invoke your SQL commands interactively through <code>mysql</code>, as
   described in the document <a href="mysql-intro.html"><i>Getting Started With MySQL</i></a>.
</li>
<li>Please write "interesting" queries. You should try to use most or all
   of the SQL constructs discussed in class and in the textbook. You
   will not receive full credit if your queries are all extremely
   simple.

<p>
   You will submit your homework using the <code>hwsubmit</code> command. Please,
   create a new directory called hw2_&lt;your_username&gt;, e.g.
   hw2_evtimov, and move all of the relevant scripts and data files
   there. Then, you can submit your work by typing (&lt;path_to&gt; is the
   directory path to your hw2 directory).
</p>
<p>
   <code>hwsubmit cspp53001 &lt;path_to&gt;/hw2_&lt;your_username&gt;</code>
</p>
<p>
   <b>Please make sure that all of the relevant files and no others are in    that directory.</b>
</p></li>
</ul>




</div>

<div id="outline-container-1-1" class="outline-4">
<h4 id="sec-1-1"><span class="section-number-4">1.1</span> Problem Set</h4>
<div class="outline-text-4" id="text-1-1">


<p>
You will complete the problem set using <a href="http://www.newgradiance.com/">Gradiance</a>.
</p>
<p>
The name of the homework is CSPPDB-Spr13 HW3. There are 11 questions
in this homework &ndash; 10 regular questions and one extra credit one
(relational division). All questions in this problem set are multiple
choice. However, to answer them correctly you will need to work out
their long (general) answers. A correct answer is worth 3 points. You
lose a point for each incorrect answer. You can attempt the problem
set as many times as you like; only your highest score will
count. Note that you will probably get slightly different questions
each time you take it.
</p>
<p>
<b>The due date for the Gradiance part of the homework is 11:59am on Thursday, May 2, 2013.</b>
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-04-23 22:24:24 CDT</p>
<p class="author">Author: Neil Best</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
